espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_eco5_reg.h
/** PMU_HP_MODEM_ICG_MODEM_REG register
 *  need_des
 */
#define PMU_HP_MODEM_ICG_MODEM_REG (DR_REG_PMU_BASE + 0x40)
/** PMU_HP_MODEM_DIG_ICG_MODEM_CODE : WT; bitpos: [31:30]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_DIG_ICG_MODEM_CODE    0x00000003U
#define PMU_HP_MODEM_DIG_ICG_MODEM_CODE_M  (PMU_HP_MODEM_DIG_ICG_MODEM_CODE_V << PMU_HP_MODEM_DIG_ICG_MODEM_CODE_S)
#define PMU_HP_MODEM_DIG_ICG_MODEM_CODE_V  0x00000003U
#define PMU_HP_MODEM_DIG_ICG_MODEM_CODE_S  30

/** PMU_HP_MODEM_HP_SYS_CNTL_REG register
 *  need_des
 */
#define PMU_HP_MODEM_HP_SYS_CNTL_REG (DR_REG_PMU_BASE + 0x44)
/** PMU_HP_MODEM_HP_POWER_DET_BYPASS : WT; bitpos: [23]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_HP_POWER_DET_BYPASS    (BIT(23))
#define PMU_HP_MODEM_HP_POWER_DET_BYPASS_M  (PMU_HP_MODEM_HP_POWER_DET_BYPASS_V << PMU_HP_MODEM_HP_POWER_DET_BYPASS_S)
#define PMU_HP_MODEM_HP_POWER_DET_BYPASS_V  0x00000001U
#define PMU_HP_MODEM_HP_POWER_DET_BYPASS_S  23
/** PMU_HP_MODEM_UART_WAKEUP_EN : WT; bitpos: [24]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_UART_WAKEUP_EN    (BIT(24))
#define PMU_HP_MODEM_UART_WAKEUP_EN_M  (PMU_HP_MODEM_UART_WAKEUP_EN_V << PMU_HP_MODEM_UART_WAKEUP_EN_S)
#define PMU_HP_MODEM_UART_WAKEUP_EN_V  0x00000001U
#define PMU_HP_MODEM_UART_WAKEUP_EN_S  24
/** PMU_HP_MODEM_LP_PAD_HOLD_ALL : WT; bitpos: [25]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_LP_PAD_HOLD_ALL    (BIT(25))
#define PMU_HP_MODEM_LP_PAD_HOLD_ALL_M  (PMU_HP_MODEM_LP_PAD_HOLD_ALL_V << PMU_HP_MODEM_LP_PAD_HOLD_ALL_S)
#define PMU_HP_MODEM_LP_PAD_HOLD_ALL_V  0x00000001U
#define PMU_HP_MODEM_LP_PAD_HOLD_ALL_S  25
/** PMU_HP_MODEM_HP_PAD_HOLD_ALL : WT; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_HP_PAD_HOLD_ALL    (BIT(26))
#define PMU_HP_MODEM_HP_PAD_HOLD_ALL_M  (PMU_HP_MODEM_HP_PAD_HOLD_ALL_V << PMU_HP_MODEM_HP_PAD_HOLD_ALL_S)
#define PMU_HP_MODEM_HP_PAD_HOLD_ALL_V  0x00000001U
#define PMU_HP_MODEM_HP_PAD_HOLD_ALL_S  26
/** PMU_HP_MODEM_DIG_PAD_SLP_SEL : WT; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_DIG_PAD_SLP_SEL    (BIT(27))
#define PMU_HP_MODEM_DIG_PAD_SLP_SEL_M  (PMU_HP_MODEM_DIG_PAD_SLP_SEL_V << PMU_HP_MODEM_DIG_PAD_SLP_SEL_S)
#define PMU_HP_MODEM_DIG_PAD_SLP_SEL_V  0x00000001U
#define PMU_HP_MODEM_DIG_PAD_SLP_SEL_S  27
/** PMU_HP_MODEM_DIG_PAUSE_WDT : WT; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_DIG_PAUSE_WDT    (BIT(28))
#define PMU_HP_MODEM_DIG_PAUSE_WDT_M  (PMU_HP_MODEM_DIG_PAUSE_WDT_V << PMU_HP_MODEM_DIG_PAUSE_WDT_S)
#define PMU_HP_MODEM_DIG_PAUSE_WDT_V  0x00000001U
#define PMU_HP_MODEM_DIG_PAUSE_WDT_S  28
/** PMU_HP_MODEM_DIG_CPU_STALL : WT; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_DIG_CPU_STALL    (BIT(29))
#define PMU_HP_MODEM_DIG_CPU_STALL_M  (PMU_HP_MODEM_DIG_CPU_STALL_V << PMU_HP_MODEM_DIG_CPU_STALL_S)
#define PMU_HP_MODEM_DIG_CPU_STALL_V  0x00000001U
#define PMU_HP_MODEM_DIG_CPU_STALL_S  29

/** PMU_HP_MODEM_HP_CK_POWER_REG register
 *  need_des
 */
#define PMU_HP_MODEM_HP_CK_POWER_REG (DR_REG_PMU_BASE + 0x48)
/** PMU_HP_MODEM_I2C_ISO_EN : WT; bitpos: [21]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_I2C_ISO_EN    (BIT(21))
#define PMU_HP_MODEM_I2C_ISO_EN_M  (PMU_HP_MODEM_I2C_ISO_EN_V << PMU_HP_MODEM_I2C_ISO_EN_S)
#define PMU_HP_MODEM_I2C_ISO_EN_V  0x00000001U
#define PMU_HP_MODEM_I2C_ISO_EN_S  21
/** PMU_HP_MODEM_I2C_RETENTION : WT; bitpos: [22]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_I2C_RETENTION    (BIT(22))
#define PMU_HP_MODEM_I2C_RETENTION_M  (PMU_HP_MODEM_I2C_RETENTION_V << PMU_HP_MODEM_I2C_RETENTION_S)
#define PMU_HP_MODEM_I2C_RETENTION_V  0x00000001U
#define PMU_HP_MODEM_I2C_RETENTION_S  22
/** PMU_HP_MODEM_XPD_PLL_I2C : WT; bitpos: [26:23]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_XPD_PLL_I2C    0x0000000FU
#define PMU_HP_MODEM_XPD_PLL_I2C_M  (PMU_HP_MODEM_XPD_PLL_I2C_V << PMU_HP_MODEM_XPD_PLL_I2C_S)
#define PMU_HP_MODEM_XPD_PLL_I2C_V  0x0000000FU
#define PMU_HP_MODEM_XPD_PLL_I2C_S  23
/** PMU_HP_MODEM_XPD_PLL : WT; bitpos: [30:27]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_XPD_PLL    0x0000000FU
#define PMU_HP_MODEM_XPD_PLL_M  (PMU_HP_MODEM_XPD_PLL_V << PMU_HP_MODEM_XPD_PLL_S)
#define PMU_HP_MODEM_XPD_PLL_V  0x0000000FU
#define PMU_HP_MODEM_XPD_PLL_S  27

/** PMU_HP_MODEM_BIAS_REG register
 *  need_des
 */
#define PMU_HP_MODEM_BIAS_REG (DR_REG_PMU_BASE + 0x4c)
/** PMU_HP_MODEM_DCM_VSET : WT; bitpos: [22:18]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_DCM_VSET    0x0000001FU
#define PMU_HP_MODEM_DCM_VSET_M  (PMU_HP_MODEM_DCM_VSET_V << PMU_HP_MODEM_DCM_VSET_S)
#define PMU_HP_MODEM_DCM_VSET_V  0x0000001FU
#define PMU_HP_MODEM_DCM_VSET_S  18
/** PMU_HP_MODEM_DCM_MODE : WT; bitpos: [24:23]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_DCM_MODE    0x00000003U
#define PMU_HP_MODEM_DCM_MODE_M  (PMU_HP_MODEM_DCM_MODE_V << PMU_HP_MODEM_DCM_MODE_S)
#define PMU_HP_MODEM_DCM_MODE_V  0x00000003U
#define PMU_HP_MODEM_DCM_MODE_S  23
/** PMU_HP_MODEM_XPD_BIAS : WT; bitpos: [25]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_XPD_BIAS    (BIT(25))
#define PMU_HP_MODEM_XPD_BIAS_M  (PMU_HP_MODEM_XPD_BIAS_V << PMU_HP_MODEM_XPD_BIAS_S)
#define PMU_HP_MODEM_XPD_BIAS_V  0x00000001U
#define PMU_HP_MODEM_XPD_BIAS_S  25
/** PMU_HP_MODEM_DBG_ATTEN : WT; bitpos: [29:26]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_DBG_ATTEN    0x0000000FU
#define PMU_HP_MODEM_DBG_ATTEN_M  (PMU_HP_MODEM_DBG_ATTEN_V << PMU_HP_MODEM_DBG_ATTEN_S)
#define PMU_HP_MODEM_DBG_ATTEN_V  0x0000000FU
#define PMU_HP_MODEM_DBG_ATTEN_S  26
/** PMU_HP_MODEM_PD_CUR : WT; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_PD_CUR    (BIT(30))
#define PMU_HP_MODEM_PD_CUR_M  (PMU_HP_MODEM_PD_CUR_V << PMU_HP_MODEM_PD_CUR_S)
#define PMU_HP_MODEM_PD_CUR_V  0x00000001U
#define PMU_HP_MODEM_PD_CUR_S  30
/** PMU_HP_MODEM_BIAS_SLEEP : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_BIAS_SLEEP    (BIT(31))
#define PMU_HP_MODEM_BIAS_SLEEP_M  (PMU_HP_MODEM_BIAS_SLEEP_V << PMU_HP_MODEM_BIAS_SLEEP_S)
#define PMU_HP_MODEM_BIAS_SLEEP_V  0x00000001U
#define PMU_HP_MODEM_BIAS_SLEEP_S  31

/** PMU_HP_MODEM_BACKUP_REG register
 *  need_des
 */
#define PMU_HP_MODEM_BACKUP_REG (DR_REG_PMU_BASE + 0x50)
/** PMU_HP_SLEEP2MODEM_BACKUP_MODEM_CLK_CODE : WT; bitpos: [5:4]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP2MODEM_BACKUP_MODEM_CLK_CODE    0x00000003U
#define PMU_HP_SLEEP2MODEM_BACKUP_MODEM_CLK_CODE_M  (PMU_HP_SLEEP2MODEM_BACKUP_MODEM_CLK_CODE_V << PMU_HP_SLEEP2MODEM_BACKUP_MODEM_CLK_CODE_S)
#define PMU_HP_SLEEP2MODEM_BACKUP_MODEM_CLK_CODE_V  0x00000003U
#define PMU_HP_SLEEP2MODEM_BACKUP_MODEM_CLK_CODE_S  4
/** PMU_HP_MODEM_RETENTION_MODE : WT; bitpos: [10]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_RETENTION_MODE    (BIT(10))
#define PMU_HP_MODEM_RETENTION_MODE_M  (PMU_HP_MODEM_RETENTION_MODE_V << PMU_HP_MODEM_RETENTION_MODE_S)
#define PMU_HP_MODEM_RETENTION_MODE_V  0x00000001U
#define PMU_HP_MODEM_RETENTION_MODE_S  10
/** PMU_HP_SLEEP2MODEM_RETENTION_EN : WT; bitpos: [11]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP2MODEM_RETENTION_EN    (BIT(11))
#define PMU_HP_SLEEP2MODEM_RETENTION_EN_M  (PMU_HP_SLEEP2MODEM_RETENTION_EN_V << PMU_HP_SLEEP2MODEM_RETENTION_EN_S)
#define PMU_HP_SLEEP2MODEM_RETENTION_EN_V  0x00000001U
#define PMU_HP_SLEEP2MODEM_RETENTION_EN_S  11
/** PMU_HP_SLEEP2MODEM_BACKUP_CLK_SEL : WT; bitpos: [15:14]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP2MODEM_BACKUP_CLK_SEL    0x00000003U
#define PMU_HP_SLEEP2MODEM_BACKUP_CLK_SEL_M  (PMU_HP_SLEEP2MODEM_BACKUP_CLK_SEL_V << PMU_HP_SLEEP2MODEM_BACKUP_CLK_SEL_S)
#define PMU_HP_SLEEP2MODEM_BACKUP_CLK_SEL_V  0x00000003U
#define PMU_HP_SLEEP2MODEM_BACKUP_CLK_SEL_S  14
/** PMU_HP_SLEEP2MODEM_BACKUP_MODE : WT; bitpos: [22:20]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP2MODEM_BACKUP_MODE    0x00000007U
#define PMU_HP_SLEEP2MODEM_BACKUP_MODE_M  (PMU_HP_SLEEP2MODEM_BACKUP_MODE_V << PMU_HP_SLEEP2MODEM_BACKUP_MODE_S)
#define PMU_HP_SLEEP2MODEM_BACKUP_MODE_V  0x00000007U
#define PMU_HP_SLEEP2MODEM_BACKUP_MODE_S  20
/** PMU_HP_SLEEP2MODEM_BACKUP_EN : WT; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP2MODEM_BACKUP_EN    (BIT(29))
#define PMU_HP_SLEEP2MODEM_BACKUP_EN_M  (PMU_HP_SLEEP2MODEM_BACKUP_EN_V << PMU_HP_SLEEP2MODEM_BACKUP_EN_S)
#define PMU_HP_SLEEP2MODEM_BACKUP_EN_V  0x00000001U
#define PMU_HP_SLEEP2MODEM_BACKUP_EN_S  29

/** PMU_HP_MODEM_BACKUP_CLK_REG register
 *  need_des
 */
#define PMU_HP_MODEM_BACKUP_CLK_REG (DR_REG_PMU_BASE + 0x54)
/** PMU_HP_MODEM_BACKUP_ICG_FUNC_EN : WT; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_BACKUP_ICG_FUNC_EN    0xFFFFFFFFU
#define PMU_HP_MODEM_BACKUP_ICG_FUNC_EN_M  (PMU_HP_MODEM_BACKUP_ICG_FUNC_EN_V << PMU_HP_MODEM_BACKUP_ICG_FUNC_EN_S)
#define PMU_HP_MODEM_BACKUP_ICG_FUNC_EN_V  0xFFFFFFFFU
#define PMU_HP_MODEM_BACKUP_ICG_FUNC_EN_S  0

/** PMU_HP_MODEM_SYSCLK_REG register
 *  need_des
 */
#define PMU_HP_MODEM_SYSCLK_REG (DR_REG_PMU_BASE + 0x58)
/** PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV : WT; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV    (BIT(26))
#define PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV_M  (PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV_V << PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV_S)
#define PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV_V  0x00000001U
#define PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV_S  26
/** PMU_HP_MODEM_ICG_SYS_CLOCK_EN : WT; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_ICG_SYS_CLOCK_EN    (BIT(27))
#define PMU_HP_MODEM_ICG_SYS_CLOCK_EN_M  (PMU_HP_MODEM_ICG_SYS_CLOCK_EN_V << PMU_HP_MODEM_ICG_SYS_CLOCK_EN_S)
#define PMU_HP_MODEM_ICG_SYS_CLOCK_EN_V  0x00000001U
#define PMU_HP_MODEM_ICG_SYS_CLOCK_EN_S  27
/** PMU_HP_MODEM_SYS_CLK_SLP_SEL : WT; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_SYS_CLK_SLP_SEL    (BIT(28))
#define PMU_HP_MODEM_SYS_CLK_SLP_SEL_M  (PMU_HP_MODEM_SYS_CLK_SLP_SEL_V << PMU_HP_MODEM_SYS_CLK_SLP_SEL_S)
#define PMU_HP_MODEM_SYS_CLK_SLP_SEL_V  0x00000001U
#define PMU_HP_MODEM_SYS_CLK_SLP_SEL_S  28
/** PMU_HP_MODEM_ICG_SLP_SEL : WT; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_ICG_SLP_SEL    (BIT(29))
#define PMU_HP_MODEM_ICG_SLP_SEL_M  (PMU_HP_MODEM_ICG_SLP_SEL_V << PMU_HP_MODEM_ICG_SLP_SEL_S)
#define PMU_HP_MODEM_ICG_SLP_SEL_V  0x00000001U
#define PMU_HP_MODEM_ICG_SLP_SEL_S  29
/** PMU_HP_MODEM_DIG_SYS_CLK_SEL : WT; bitpos: [31:30]; default: 0;
 *  need_des
 */
#define PMU_HP_MODEM_DIG_SYS_CLK_SEL    0x00000003U
#define PMU_HP_MODEM_DIG_SYS_CLK_SEL_M  (PMU_HP_MODEM_DIG_SYS_CLK_SEL_V << PMU_HP_MODEM_DIG_SYS_CLK_SEL_S)
#define PMU_HP_MODEM_DIG_SYS_CLK_SEL_V  0x00000003U
#define PMU_HP_MODEM_DIG_SYS_CLK_SEL_S  30

