espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_eco5_reg.h
/** PMU_SLP_WAKEUP_CNTL0_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_CNTL0_REG (DR_REG_PMU_BASE + 0x120)
/** PMU_SLEEP_REQ : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_SLEEP_REQ    (BIT(31))
#define PMU_SLEEP_REQ_M  (PMU_SLEEP_REQ_V << PMU_SLEEP_REQ_S)
#define PMU_SLEEP_REQ_V  0x00000001U
#define PMU_SLEEP_REQ_S  31

/** PMU_SLP_WAKEUP_CNTL1_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_CNTL1_REG (DR_REG_PMU_BASE + 0x124)
/** PMU_SLEEP_REJECT_ENA : R/W; bitpos: [30:0]; default: 0;
 *  need_des
 */
#define PMU_SLEEP_REJECT_ENA    0x7FFFFFFFU
#define PMU_SLEEP_REJECT_ENA_M  (PMU_SLEEP_REJECT_ENA_V << PMU_SLEEP_REJECT_ENA_S)
#define PMU_SLEEP_REJECT_ENA_V  0x7FFFFFFFU
#define PMU_SLEEP_REJECT_ENA_S  0
/** PMU_SLP_REJECT_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_SLP_REJECT_EN    (BIT(31))
#define PMU_SLP_REJECT_EN_M  (PMU_SLP_REJECT_EN_V << PMU_SLP_REJECT_EN_S)
#define PMU_SLP_REJECT_EN_V  0x00000001U
#define PMU_SLP_REJECT_EN_S  31

/** PMU_SLP_WAKEUP_CNTL2_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_CNTL2_REG (DR_REG_PMU_BASE + 0x128)
/** PMU_WAKEUP_ENA : R/W; bitpos: [30:0]; default: 0;
 *  need_des
 */
#define PMU_WAKEUP_ENA    0x7FFFFFFFU
#define PMU_WAKEUP_ENA_M  (PMU_WAKEUP_ENA_V << PMU_WAKEUP_ENA_S)
#define PMU_WAKEUP_ENA_V  0x7FFFFFFFU
#define PMU_WAKEUP_ENA_S  0

/** PMU_SLP_WAKEUP_CNTL3_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_CNTL3_REG (DR_REG_PMU_BASE + 0x12c)
/** PMU_LP_MIN_SLP_VAL : R/W; bitpos: [7:0]; default: 0;
 *  need_des
 */
#define PMU_LP_MIN_SLP_VAL    0x000000FFU
#define PMU_LP_MIN_SLP_VAL_M  (PMU_LP_MIN_SLP_VAL_V << PMU_LP_MIN_SLP_VAL_S)
#define PMU_LP_MIN_SLP_VAL_V  0x000000FFU
#define PMU_LP_MIN_SLP_VAL_S  0
/** PMU_HP_MIN_SLP_VAL : R/W; bitpos: [15:8]; default: 0;
 *  need_des
 */
#define PMU_HP_MIN_SLP_VAL    0x000000FFU
#define PMU_HP_MIN_SLP_VAL_M  (PMU_HP_MIN_SLP_VAL_V << PMU_HP_MIN_SLP_VAL_S)
#define PMU_HP_MIN_SLP_VAL_V  0x000000FFU
#define PMU_HP_MIN_SLP_VAL_S  8
/** PMU_SLEEP_PRT_SEL : R/W; bitpos: [17:16]; default: 0;
 *  need_des
 */
#define PMU_SLEEP_PRT_SEL    0x00000003U
#define PMU_SLEEP_PRT_SEL_M  (PMU_SLEEP_PRT_SEL_V << PMU_SLEEP_PRT_SEL_S)
#define PMU_SLEEP_PRT_SEL_V  0x00000003U
#define PMU_SLEEP_PRT_SEL_S  16

/** PMU_SLP_WAKEUP_CNTL4_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_CNTL4_REG (DR_REG_PMU_BASE + 0x130)
/** PMU_SLP_REJECT_CAUSE_CLR : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_SLP_REJECT_CAUSE_CLR    (BIT(31))
#define PMU_SLP_REJECT_CAUSE_CLR_M  (PMU_SLP_REJECT_CAUSE_CLR_V << PMU_SLP_REJECT_CAUSE_CLR_S)
#define PMU_SLP_REJECT_CAUSE_CLR_V  0x00000001U
#define PMU_SLP_REJECT_CAUSE_CLR_S  31

/** PMU_SLP_WAKEUP_CNTL5_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_CNTL5_REG (DR_REG_PMU_BASE + 0x134)
/** PMU_MODEM_WAIT_TARGET : R/W; bitpos: [19:0]; default: 128;
 *  need_des
 */
#define PMU_MODEM_WAIT_TARGET    0x000FFFFFU
#define PMU_MODEM_WAIT_TARGET_M  (PMU_MODEM_WAIT_TARGET_V << PMU_MODEM_WAIT_TARGET_S)
#define PMU_MODEM_WAIT_TARGET_V  0x000FFFFFU
#define PMU_MODEM_WAIT_TARGET_S  0
/** PMU_LP_ANA_WAIT_TARGET_EXPAND : R/W; bitpos: [23:22]; default: 0;
 *  need_des
 */
#define PMU_LP_ANA_WAIT_TARGET_EXPAND    0x00000003U
#define PMU_LP_ANA_WAIT_TARGET_EXPAND_M  (PMU_LP_ANA_WAIT_TARGET_EXPAND_V << PMU_LP_ANA_WAIT_TARGET_EXPAND_S)
#define PMU_LP_ANA_WAIT_TARGET_EXPAND_V  0x00000003U
#define PMU_LP_ANA_WAIT_TARGET_EXPAND_S  22
/** PMU_LP_ANA_WAIT_TARGET : R/W; bitpos: [31:24]; default: 1;
 *  need_des
 */
#define PMU_LP_ANA_WAIT_TARGET    0x000000FFU
#define PMU_LP_ANA_WAIT_TARGET_M  (PMU_LP_ANA_WAIT_TARGET_V << PMU_LP_ANA_WAIT_TARGET_S)
#define PMU_LP_ANA_WAIT_TARGET_V  0x000000FFU
#define PMU_LP_ANA_WAIT_TARGET_S  24

/** PMU_SLP_WAKEUP_CNTL6_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_CNTL6_REG (DR_REG_PMU_BASE + 0x138)
/** PMU_SOC_WAKEUP_WAIT : R/W; bitpos: [19:0]; default: 128;
 *  need_des
 */
#define PMU_SOC_WAKEUP_WAIT    0x000FFFFFU
#define PMU_SOC_WAKEUP_WAIT_M  (PMU_SOC_WAKEUP_WAIT_V << PMU_SOC_WAKEUP_WAIT_S)
#define PMU_SOC_WAKEUP_WAIT_V  0x000FFFFFU
#define PMU_SOC_WAKEUP_WAIT_S  0
/** PMU_SOC_WAKEUP_WAIT_CFG : R/W; bitpos: [31:30]; default: 0;
 *  need_des
 */
#define PMU_SOC_WAKEUP_WAIT_CFG    0x00000003U
#define PMU_SOC_WAKEUP_WAIT_CFG_M  (PMU_SOC_WAKEUP_WAIT_CFG_V << PMU_SOC_WAKEUP_WAIT_CFG_S)
#define PMU_SOC_WAKEUP_WAIT_CFG_V  0x00000003U
#define PMU_SOC_WAKEUP_WAIT_CFG_S  30

/** PMU_SLP_WAKEUP_CNTL7_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_CNTL7_REG (DR_REG_PMU_BASE + 0x13c)
/** PMU_ANA_WAIT_TARGET : R/W; bitpos: [31:16]; default: 1;
 *  need_des
 */
#define PMU_ANA_WAIT_TARGET    0x0000FFFFU
#define PMU_ANA_WAIT_TARGET_M  (PMU_ANA_WAIT_TARGET_V << PMU_ANA_WAIT_TARGET_S)
#define PMU_ANA_WAIT_TARGET_V  0x0000FFFFU
#define PMU_ANA_WAIT_TARGET_S  16

/** PMU_SLP_WAKEUP_CNTL8_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_CNTL8_REG (DR_REG_PMU_BASE + 0x140)
/** PMU_LP_LITE_WAKEUP_ENA : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_LP_LITE_WAKEUP_ENA    (BIT(31))
#define PMU_LP_LITE_WAKEUP_ENA_M  (PMU_LP_LITE_WAKEUP_ENA_V << PMU_LP_LITE_WAKEUP_ENA_S)
#define PMU_LP_LITE_WAKEUP_ENA_V  0x00000001U
#define PMU_LP_LITE_WAKEUP_ENA_S  31

/** PMU_SLP_WAKEUP_STATUS0_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_STATUS0_REG (DR_REG_PMU_BASE + 0x144)
/** PMU_WAKEUP_CAUSE : RO; bitpos: [30:0]; default: 0;
 *  need_des
 */
#define PMU_WAKEUP_CAUSE    0x7FFFFFFFU
#define PMU_WAKEUP_CAUSE_M  (PMU_WAKEUP_CAUSE_V << PMU_WAKEUP_CAUSE_S)
#define PMU_WAKEUP_CAUSE_V  0x7FFFFFFFU
#define PMU_WAKEUP_CAUSE_S  0

/** PMU_SLP_WAKEUP_STATUS1_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_STATUS1_REG (DR_REG_PMU_BASE + 0x148)
/** PMU_REJECT_CAUSE : RO; bitpos: [30:0]; default: 0;
 *  need_des
 */
#define PMU_REJECT_CAUSE    0x7FFFFFFFU
#define PMU_REJECT_CAUSE_M  (PMU_REJECT_CAUSE_V << PMU_REJECT_CAUSE_S)
#define PMU_REJECT_CAUSE_V  0x7FFFFFFFU
#define PMU_REJECT_CAUSE_S  0

/** PMU_SLP_WAKEUP_STATUS2_REG register
 *  need_des
 */
#define PMU_SLP_WAKEUP_STATUS2_REG (DR_REG_PMU_BASE + 0x14c)
/** PMU_LP_LITE_WAKEUP_CAUSE : RO; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_LP_LITE_WAKEUP_CAUSE    (BIT(31))
#define PMU_LP_LITE_WAKEUP_CAUSE_M  (PMU_LP_LITE_WAKEUP_CAUSE_V << PMU_LP_LITE_WAKEUP_CAUSE_S)
#define PMU_LP_LITE_WAKEUP_CAUSE_V  0x00000001U
#define PMU_LP_LITE_WAKEUP_CAUSE_S  31

/** PMU_HP_CK_POWERON_REG register
 *  need_des
 */
#define PMU_HP_CK_POWERON_REG (DR_REG_PMU_BASE + 0x150)
/** PMU_I2C_POR_WAIT_TARGET : R/W; bitpos: [7:0]; default: 50;
 *  need_des
 */
#define PMU_I2C_POR_WAIT_TARGET    0x000000FFU
#define PMU_I2C_POR_WAIT_TARGET_M  (PMU_I2C_POR_WAIT_TARGET_V << PMU_I2C_POR_WAIT_TARGET_S)
#define PMU_I2C_POR_WAIT_TARGET_V  0x000000FFU
#define PMU_I2C_POR_WAIT_TARGET_S  0

/** PMU_HP_CK_CNTL_REG register
 *  need_des
 */
#define PMU_HP_CK_CNTL_REG (DR_REG_PMU_BASE + 0x154)
/** PMU_MODIFY_ICG_CNTL_WAIT : R/W; bitpos: [7:0]; default: 10;
 *  need_des
 */
#define PMU_MODIFY_ICG_CNTL_WAIT    0x000000FFU
#define PMU_MODIFY_ICG_CNTL_WAIT_M  (PMU_MODIFY_ICG_CNTL_WAIT_V << PMU_MODIFY_ICG_CNTL_WAIT_S)
#define PMU_MODIFY_ICG_CNTL_WAIT_V  0x000000FFU
#define PMU_MODIFY_ICG_CNTL_WAIT_S  0
/** PMU_SWITCH_ICG_CNTL_WAIT : R/W; bitpos: [15:8]; default: 10;
 *  need_des
 */
#define PMU_SWITCH_ICG_CNTL_WAIT    0x000000FFU
#define PMU_SWITCH_ICG_CNTL_WAIT_M  (PMU_SWITCH_ICG_CNTL_WAIT_V << PMU_SWITCH_ICG_CNTL_WAIT_S)
#define PMU_SWITCH_ICG_CNTL_WAIT_V  0x000000FFU
#define PMU_SWITCH_ICG_CNTL_WAIT_S  8

/** PMU_POR_STATUS_REG register
 *  need_des
 */
#define PMU_POR_STATUS_REG (DR_REG_PMU_BASE + 0x158)
/** PMU_POR_DONE : RO; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_POR_DONE    (BIT(31))
#define PMU_POR_DONE_M  (PMU_POR_DONE_V << PMU_POR_DONE_S)
#define PMU_POR_DONE_V  0x00000001U
#define PMU_POR_DONE_S  31

/** PMU_RF_PWC_REG register
 *  need_des
 */
#define PMU_RF_PWC_REG (DR_REG_PMU_BASE + 0x15c)
/** PMU_MSPI_PHY_XPD : R/W; bitpos: [24]; default: 0;
 *  need_des
 */
#define PMU_MSPI_PHY_XPD    (BIT(24))
#define PMU_MSPI_PHY_XPD_M  (PMU_MSPI_PHY_XPD_V << PMU_MSPI_PHY_XPD_S)
#define PMU_MSPI_PHY_XPD_V  0x00000001U
#define PMU_MSPI_PHY_XPD_S  24
/** PMU_SDIO_PLL_XPD : R/W; bitpos: [25]; default: 0;
 *  need_des
 */
#define PMU_SDIO_PLL_XPD    (BIT(25))
#define PMU_SDIO_PLL_XPD_M  (PMU_SDIO_PLL_XPD_V << PMU_SDIO_PLL_XPD_S)
#define PMU_SDIO_PLL_XPD_V  0x00000001U
#define PMU_SDIO_PLL_XPD_S  25
/** PMU_PERIF_I2C_RSTB : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_PERIF_I2C_RSTB    (BIT(26))
#define PMU_PERIF_I2C_RSTB_M  (PMU_PERIF_I2C_RSTB_V << PMU_PERIF_I2C_RSTB_S)
#define PMU_PERIF_I2C_RSTB_V  0x00000001U
#define PMU_PERIF_I2C_RSTB_S  26
/** PMU_XPD_PERIF_I2C : R/W; bitpos: [27]; default: 1;
 *  need_des
 */
#define PMU_XPD_PERIF_I2C    (BIT(27))
#define PMU_XPD_PERIF_I2C_M  (PMU_XPD_PERIF_I2C_V << PMU_XPD_PERIF_I2C_S)
#define PMU_XPD_PERIF_I2C_V  0x00000001U
#define PMU_XPD_PERIF_I2C_S  27
/** PMU_XPD_TXRF_I2C : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_XPD_TXRF_I2C    (BIT(28))
#define PMU_XPD_TXRF_I2C_M  (PMU_XPD_TXRF_I2C_V << PMU_XPD_TXRF_I2C_S)
#define PMU_XPD_TXRF_I2C_V  0x00000001U
#define PMU_XPD_TXRF_I2C_S  28
/** PMU_XPD_RFRX_PBUS : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_XPD_RFRX_PBUS    (BIT(29))
#define PMU_XPD_RFRX_PBUS_M  (PMU_XPD_RFRX_PBUS_V << PMU_XPD_RFRX_PBUS_S)
#define PMU_XPD_RFRX_PBUS_V  0x00000001U
#define PMU_XPD_RFRX_PBUS_S  29
/** PMU_XPD_CKGEN_I2C : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_XPD_CKGEN_I2C    (BIT(30))
#define PMU_XPD_CKGEN_I2C_M  (PMU_XPD_CKGEN_I2C_V << PMU_XPD_CKGEN_I2C_S)
#define PMU_XPD_CKGEN_I2C_V  0x00000001U
#define PMU_XPD_CKGEN_I2C_S  30

/** PMU_BACKUP_CFG_REG register
 *  need_des
 */
#define PMU_BACKUP_CFG_REG (DR_REG_PMU_BASE + 0x160)
/** PMU_BACKUP_SYS_CLK_NO_DIV : R/W; bitpos: [31]; default: 1;
 *  need_des
 */
#define PMU_BACKUP_SYS_CLK_NO_DIV    (BIT(31))
#define PMU_BACKUP_SYS_CLK_NO_DIV_M  (PMU_BACKUP_SYS_CLK_NO_DIV_V << PMU_BACKUP_SYS_CLK_NO_DIV_S)
#define PMU_BACKUP_SYS_CLK_NO_DIV_V  0x00000001U
#define PMU_BACKUP_SYS_CLK_NO_DIV_S  31

/** PMU_INT_RAW_REG register
 *  need_des
 */
#define PMU_INT_RAW_REG (DR_REG_PMU_BASE + 0x164)
/** PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_RAW : R/WTC/SS; bitpos: [14]; default: 0;
 *  reg_0p1a_0_counter after xpd reach target0
 */
#define PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_RAW    (BIT(14))
#define PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_RAW_M  (PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_RAW_V << PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_RAW_S)
#define PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_RAW_V  0x00000001U
#define PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_RAW_S  14
/** PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_RAW : R/WTC/SS; bitpos: [15]; default: 0;
 *  reg_0p1a_1_counter after xpd reach target1
 */
#define PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_RAW    (BIT(15))
#define PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_RAW_M  (PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_RAW_V << PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_RAW_S)
#define PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_RAW_V  0x00000001U
#define PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_RAW_S  15
/** PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_RAW : R/WTC/SS; bitpos: [16]; default: 0;
 *  reg_0p1a_0 counter after xpd reach target0
 */
#define PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_RAW    (BIT(16))
#define PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_RAW_M  (PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_RAW_V << PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_RAW_S)
#define PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_RAW_V  0x00000001U
#define PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_RAW_S  16
/** PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_RAW : R/WTC/SS; bitpos: [17]; default: 0;
 *  reg_0p1a_1_counter after xpd reach target1
 */
#define PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_RAW    (BIT(17))
#define PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_RAW_M  (PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_RAW_V << PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_RAW_S)
#define PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_RAW_V  0x00000001U
#define PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_RAW_S  17
/** PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_RAW : R/WTC/SS; bitpos: [18]; default: 0;
 *  reg_0p2a_0 counter after xpd reach target0
 */
#define PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_RAW    (BIT(18))
#define PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_RAW_M  (PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_RAW_V << PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_RAW_S)
#define PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_RAW_V  0x00000001U
#define PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_RAW_S  18
/** PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_RAW : R/WTC/SS; bitpos: [19]; default: 0;
 *  reg_0p2a_1_counter after xpd reach target1
 */
#define PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_RAW    (BIT(19))
#define PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_RAW_M  (PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_RAW_V << PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_RAW_S)
#define PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_RAW_V  0x00000001U
#define PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_RAW_S  19
/** PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_RAW : R/WTC/SS; bitpos: [20]; default: 0;
 *  reg_0p2a_0 counter after xpd reach target0
 */
#define PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_RAW    (BIT(20))
#define PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_RAW_M  (PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_RAW_V << PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_RAW_S)
#define PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_RAW_V  0x00000001U
#define PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_RAW_S  20
/** PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_RAW : R/WTC/SS; bitpos: [21]; default: 0;
 *  reg_0p2a_1_counter after xpd reach target1
 */
#define PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_RAW    (BIT(21))
#define PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_RAW_M  (PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_RAW_V << PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_RAW_S)
#define PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_RAW_V  0x00000001U
#define PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_RAW_S  21
/** PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_RAW : R/WTC/SS; bitpos: [22]; default: 0;
 *  reg_0p3a_0 counter after xpd reach target0
 */
#define PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_RAW    (BIT(22))
#define PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_RAW_M  (PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_RAW_V << PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_RAW_S)
#define PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_RAW_V  0x00000001U
#define PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_RAW_S  22
/** PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_RAW : R/WTC/SS; bitpos: [23]; default: 0;
 *  reg_0p3a_1_counter after xpd reach target1
 */
#define PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_RAW    (BIT(23))
#define PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_RAW_M  (PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_RAW_V << PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_RAW_S)
#define PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_RAW_V  0x00000001U
#define PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_RAW_S  23
/** PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_RAW : R/WTC/SS; bitpos: [24]; default: 0;
 *  reg_0p3a_0_counter after xpd reach target0
 */
#define PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_RAW    (BIT(24))
#define PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_RAW_M  (PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_RAW_V << PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_RAW_S)
#define PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_RAW_V  0x00000001U
#define PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_RAW_S  24
/** PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_RAW : R/WTC/SS; bitpos: [25]; default: 0;
 *  reg_0p3a_1_counter after xpd reach target1
 */
#define PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_RAW    (BIT(25))
#define PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_RAW_M  (PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_RAW_V << PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_RAW_S)
#define PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_RAW_V  0x00000001U
#define PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_RAW_S  25
/** PMU_LP_CPU_EXC_INT_RAW : R/WTC/SS; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_EXC_INT_RAW    (BIT(27))
#define PMU_LP_CPU_EXC_INT_RAW_M  (PMU_LP_CPU_EXC_INT_RAW_V << PMU_LP_CPU_EXC_INT_RAW_S)
#define PMU_LP_CPU_EXC_INT_RAW_V  0x00000001U
#define PMU_LP_CPU_EXC_INT_RAW_S  27
/** PMU_SDIO_IDLE_INT_RAW : R/WTC/SS; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_SDIO_IDLE_INT_RAW    (BIT(28))
#define PMU_SDIO_IDLE_INT_RAW_M  (PMU_SDIO_IDLE_INT_RAW_V << PMU_SDIO_IDLE_INT_RAW_S)
#define PMU_SDIO_IDLE_INT_RAW_V  0x00000001U
#define PMU_SDIO_IDLE_INT_RAW_S  28
/** PMU_SW_INT_RAW : R/WTC/SS; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_SW_INT_RAW    (BIT(29))
#define PMU_SW_INT_RAW_M  (PMU_SW_INT_RAW_V << PMU_SW_INT_RAW_S)
#define PMU_SW_INT_RAW_V  0x00000001U
#define PMU_SW_INT_RAW_S  29
/** PMU_SOC_SLEEP_REJECT_INT_RAW : R/WTC/SS; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_SOC_SLEEP_REJECT_INT_RAW    (BIT(30))
#define PMU_SOC_SLEEP_REJECT_INT_RAW_M  (PMU_SOC_SLEEP_REJECT_INT_RAW_V << PMU_SOC_SLEEP_REJECT_INT_RAW_S)
#define PMU_SOC_SLEEP_REJECT_INT_RAW_V  0x00000001U
#define PMU_SOC_SLEEP_REJECT_INT_RAW_S  30
/** PMU_SOC_WAKEUP_INT_RAW : R/WTC/SS; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_SOC_WAKEUP_INT_RAW    (BIT(31))
#define PMU_SOC_WAKEUP_INT_RAW_M  (PMU_SOC_WAKEUP_INT_RAW_V << PMU_SOC_WAKEUP_INT_RAW_S)
#define PMU_SOC_WAKEUP_INT_RAW_V  0x00000001U
#define PMU_SOC_WAKEUP_INT_RAW_S  31

/** PMU_HP_INT_ST_REG register
 *  need_des
 */
#define PMU_HP_INT_ST_REG (DR_REG_PMU_BASE + 0x168)
/** PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_ST : RO; bitpos: [14]; default: 0;
 *  reg_0p1a_0_counter after xpd reach target0
 */
#define PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_ST    (BIT(14))
#define PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_ST_M  (PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_ST_V << PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_ST_S)
#define PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_ST_V  0x00000001U
#define PMU_0P1A_CNT_TARGET0_REACH_0_HP_INT_ST_S  14
/** PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_ST : RO; bitpos: [15]; default: 0;
 *  reg_0p1a_1_counter after xpd reach target1
 */
#define PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_ST    (BIT(15))
#define PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_ST_M  (PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_ST_V << PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_ST_S)
#define PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_ST_V  0x00000001U
#define PMU_0P1A_CNT_TARGET1_REACH_0_HP_INT_ST_S  15
/** PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_ST : RO; bitpos: [16]; default: 0;
 *  reg_0p1a_0 counter after xpd reach target0
 */
#define PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_ST    (BIT(16))
#define PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_ST_M  (PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_ST_V << PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_ST_S)
#define PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_ST_V  0x00000001U
#define PMU_0P1A_CNT_TARGET0_REACH_1_HP_INT_ST_S  16
/** PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_ST : RO; bitpos: [17]; default: 0;
 *  reg_0p1a_1_counter after xpd reach target1
 */
#define PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_ST    (BIT(17))
#define PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_ST_M  (PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_ST_V << PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_ST_S)
#define PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_ST_V  0x00000001U
#define PMU_0P1A_CNT_TARGET1_REACH_1_HP_INT_ST_S  17
/** PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_ST : RO; bitpos: [18]; default: 0;
 *  reg_0p2a_0 counter after xpd reach target0
 */
#define PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_ST    (BIT(18))
#define PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_ST_M  (PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_ST_V << PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_ST_S)
#define PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_ST_V  0x00000001U
#define PMU_0P2A_CNT_TARGET0_REACH_0_HP_INT_ST_S  18
/** PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_ST : RO; bitpos: [19]; default: 0;
 *  reg_0p2a_1_counter after xpd reach target1
 */
#define PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_ST    (BIT(19))
#define PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_ST_M  (PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_ST_V << PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_ST_S)
#define PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_ST_V  0x00000001U
#define PMU_0P2A_CNT_TARGET1_REACH_0_HP_INT_ST_S  19
/** PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_ST : RO; bitpos: [20]; default: 0;
 *  reg_0p2a_0 counter after xpd reach target0
 */
#define PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_ST    (BIT(20))
#define PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_ST_M  (PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_ST_V << PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_ST_S)
#define PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_ST_V  0x00000001U
#define PMU_0P2A_CNT_TARGET0_REACH_1_HP_INT_ST_S  20
/** PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_ST : RO; bitpos: [21]; default: 0;
 *  reg_0p2a_1_counter after xpd reach target1
 */
#define PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_ST    (BIT(21))
#define PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_ST_M  (PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_ST_V << PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_ST_S)
#define PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_ST_V  0x00000001U
#define PMU_0P2A_CNT_TARGET1_REACH_1_HP_INT_ST_S  21
/** PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_ST : RO; bitpos: [22]; default: 0;
 *  reg_0p3a_0 counter after xpd reach target0
 */
#define PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_ST    (BIT(22))
#define PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_ST_M  (PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_ST_V << PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_ST_S)
#define PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_ST_V  0x00000001U
#define PMU_0P3A_CNT_TARGET0_REACH_0_HP_INT_ST_S  22
/** PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_ST : RO; bitpos: [23]; default: 0;
 *  reg_0p3a_1_counter after xpd reach target1
 */
#define PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_ST    (BIT(23))
#define PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_ST_M  (PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_ST_V << PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_ST_S)
#define PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_ST_V  0x00000001U
#define PMU_0P3A_CNT_TARGET1_REACH_0_HP_INT_ST_S  23
/** PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_ST : RO; bitpos: [24]; default: 0;
 *  reg_0p3a_0_counter after xpd reach target0
 */
#define PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_ST    (BIT(24))
#define PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_ST_M  (PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_ST_V << PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_ST_S)
#define PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_ST_V  0x00000001U
#define PMU_0P3A_CNT_TARGET0_REACH_1_HP_INT_ST_S  24
/** PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_ST : RO; bitpos: [25]; default: 0;
 *  reg_0p3a_1_counter after xpd reach target1
 */
#define PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_ST    (BIT(25))
#define PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_ST_M  (PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_ST_V << PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_ST_S)
#define PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_ST_V  0x00000001U
#define PMU_0P3A_CNT_TARGET1_REACH_1_HP_INT_ST_S  25
/** PMU_LP_CPU_EXC_INT_ST : RO; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_EXC_INT_ST    (BIT(27))
#define PMU_LP_CPU_EXC_INT_ST_M  (PMU_LP_CPU_EXC_INT_ST_V << PMU_LP_CPU_EXC_INT_ST_S)
#define PMU_LP_CPU_EXC_INT_ST_V  0x00000001U
#define PMU_LP_CPU_EXC_INT_ST_S  27
/** PMU_SDIO_IDLE_INT_ST : RO; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_SDIO_IDLE_INT_ST    (BIT(28))
#define PMU_SDIO_IDLE_INT_ST_M  (PMU_SDIO_IDLE_INT_ST_V << PMU_SDIO_IDLE_INT_ST_S)
#define PMU_SDIO_IDLE_INT_ST_V  0x00000001U
#define PMU_SDIO_IDLE_INT_ST_S  28
/** PMU_SW_INT_ST : RO; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_SW_INT_ST    (BIT(29))
#define PMU_SW_INT_ST_M  (PMU_SW_INT_ST_V << PMU_SW_INT_ST_S)
#define PMU_SW_INT_ST_V  0x00000001U
#define PMU_SW_INT_ST_S  29
/** PMU_SOC_SLEEP_REJECT_INT_ST : RO; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_SOC_SLEEP_REJECT_INT_ST    (BIT(30))
#define PMU_SOC_SLEEP_REJECT_INT_ST_M  (PMU_SOC_SLEEP_REJECT_INT_ST_V << PMU_SOC_SLEEP_REJECT_INT_ST_S)
#define PMU_SOC_SLEEP_REJECT_INT_ST_V  0x00000001U
#define PMU_SOC_SLEEP_REJECT_INT_ST_S  30
/** PMU_SOC_WAKEUP_INT_ST : RO; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_SOC_WAKEUP_INT_ST    (BIT(31))
#define PMU_SOC_WAKEUP_INT_ST_M  (PMU_SOC_WAKEUP_INT_ST_V << PMU_SOC_WAKEUP_INT_ST_S)
#define PMU_SOC_WAKEUP_INT_ST_V  0x00000001U
#define PMU_SOC_WAKEUP_INT_ST_S  31

