espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/pmu_eco5_reg.h
/** PMU_LP_INT_ST_REG register
 *  need_des
 */
#define PMU_LP_INT_ST_REG (DR_REG_PMU_BASE + 0x178)
/** PMU_LP_CPU_SLEEP_REJECT_INT_ST : RO; bitpos: [13]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_SLEEP_REJECT_INT_ST    (BIT(13))
#define PMU_LP_CPU_SLEEP_REJECT_INT_ST_M  (PMU_LP_CPU_SLEEP_REJECT_INT_ST_V << PMU_LP_CPU_SLEEP_REJECT_INT_ST_S)
#define PMU_LP_CPU_SLEEP_REJECT_INT_ST_V  0x00000001U
#define PMU_LP_CPU_SLEEP_REJECT_INT_ST_S  13
/** PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ST : RO; bitpos: [14]; default: 0;
 *  reg_0p1a_0_counter after xpd reach target0
 */
#define PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ST    (BIT(14))
#define PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ST_M  (PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ST_V << PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ST_S)
#define PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ST_V  0x00000001U
#define PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ST_S  14
/** PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ST : RO; bitpos: [15]; default: 0;
 *  reg_0p1a_1_counter after xpd reach target1
 */
#define PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ST    (BIT(15))
#define PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ST_M  (PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ST_V << PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ST_S)
#define PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ST_V  0x00000001U
#define PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ST_S  15
/** PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ST : RO; bitpos: [16]; default: 0;
 *  reg_0p1a_0 counter after xpd reach target0
 */
#define PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ST    (BIT(16))
#define PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ST_M  (PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ST_V << PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ST_S)
#define PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ST_V  0x00000001U
#define PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ST_S  16
/** PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ST : RO; bitpos: [17]; default: 0;
 *  reg_0p1a_1_counter after xpd reach target1
 */
#define PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ST    (BIT(17))
#define PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ST_M  (PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ST_V << PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ST_S)
#define PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ST_V  0x00000001U
#define PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ST_S  17
/** PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ST : RO; bitpos: [18]; default: 0;
 *  reg_0p2a_0 counter after xpd reach target0
 */
#define PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ST    (BIT(18))
#define PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ST_M  (PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ST_V << PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ST_S)
#define PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ST_V  0x00000001U
#define PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ST_S  18
/** PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ST : RO; bitpos: [19]; default: 0;
 *  reg_0p2a_1_counter after xpd reach target1
 */
#define PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ST    (BIT(19))
#define PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ST_M  (PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ST_V << PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ST_S)
#define PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ST_V  0x00000001U
#define PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ST_S  19
/** PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ST : RO; bitpos: [20]; default: 0;
 *  reg_0p2a_0 counter after xpd reach target0
 */
#define PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ST    (BIT(20))
#define PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ST_M  (PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ST_V << PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ST_S)
#define PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ST_V  0x00000001U
#define PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ST_S  20
/** PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ST : RO; bitpos: [21]; default: 0;
 *  reg_0p2a_1_counter after xpd reach target1
 */
#define PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ST    (BIT(21))
#define PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ST_M  (PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ST_V << PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ST_S)
#define PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ST_V  0x00000001U
#define PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ST_S  21
/** PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ST : RO; bitpos: [22]; default: 0;
 *  reg_0p3a_0 counter after xpd reach target0
 */
#define PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ST    (BIT(22))
#define PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ST_M  (PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ST_V << PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ST_S)
#define PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ST_V  0x00000001U
#define PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ST_S  22
/** PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ST : RO; bitpos: [23]; default: 0;
 *  reg_0p3a_1_counter after xpd reach target1
 */
#define PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ST    (BIT(23))
#define PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ST_M  (PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ST_V << PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ST_S)
#define PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ST_V  0x00000001U
#define PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ST_S  23
/** PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ST : RO; bitpos: [24]; default: 0;
 *  reg_0p3a_0_counter after xpd reach target0
 */
#define PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ST    (BIT(24))
#define PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ST_M  (PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ST_V << PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ST_S)
#define PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ST_V  0x00000001U
#define PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ST_S  24
/** PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ST : RO; bitpos: [25]; default: 0;
 *  reg_0p3a_1_counter after xpd reach target1
 */
#define PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ST    (BIT(25))
#define PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ST_M  (PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ST_V << PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ST_S)
#define PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ST_V  0x00000001U
#define PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ST_S  25
/** PMU_LP_CPU_WAKEUP_INT_ST : RO; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_WAKEUP_INT_ST    (BIT(26))
#define PMU_LP_CPU_WAKEUP_INT_ST_M  (PMU_LP_CPU_WAKEUP_INT_ST_V << PMU_LP_CPU_WAKEUP_INT_ST_S)
#define PMU_LP_CPU_WAKEUP_INT_ST_V  0x00000001U
#define PMU_LP_CPU_WAKEUP_INT_ST_S  26
/** PMU_SLEEP_SWITCH_ACTIVE_END_INT_ST : RO; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_SLEEP_SWITCH_ACTIVE_END_INT_ST    (BIT(27))
#define PMU_SLEEP_SWITCH_ACTIVE_END_INT_ST_M  (PMU_SLEEP_SWITCH_ACTIVE_END_INT_ST_V << PMU_SLEEP_SWITCH_ACTIVE_END_INT_ST_S)
#define PMU_SLEEP_SWITCH_ACTIVE_END_INT_ST_V  0x00000001U
#define PMU_SLEEP_SWITCH_ACTIVE_END_INT_ST_S  27
/** PMU_ACTIVE_SWITCH_SLEEP_END_INT_ST : RO; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_ACTIVE_SWITCH_SLEEP_END_INT_ST    (BIT(28))
#define PMU_ACTIVE_SWITCH_SLEEP_END_INT_ST_M  (PMU_ACTIVE_SWITCH_SLEEP_END_INT_ST_V << PMU_ACTIVE_SWITCH_SLEEP_END_INT_ST_S)
#define PMU_ACTIVE_SWITCH_SLEEP_END_INT_ST_V  0x00000001U
#define PMU_ACTIVE_SWITCH_SLEEP_END_INT_ST_S  28
/** PMU_SLEEP_SWITCH_ACTIVE_START_INT_ST : RO; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_SLEEP_SWITCH_ACTIVE_START_INT_ST    (BIT(29))
#define PMU_SLEEP_SWITCH_ACTIVE_START_INT_ST_M  (PMU_SLEEP_SWITCH_ACTIVE_START_INT_ST_V << PMU_SLEEP_SWITCH_ACTIVE_START_INT_ST_S)
#define PMU_SLEEP_SWITCH_ACTIVE_START_INT_ST_V  0x00000001U
#define PMU_SLEEP_SWITCH_ACTIVE_START_INT_ST_S  29
/** PMU_ACTIVE_SWITCH_SLEEP_START_INT_ST : RO; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_ACTIVE_SWITCH_SLEEP_START_INT_ST    (BIT(30))
#define PMU_ACTIVE_SWITCH_SLEEP_START_INT_ST_M  (PMU_ACTIVE_SWITCH_SLEEP_START_INT_ST_V << PMU_ACTIVE_SWITCH_SLEEP_START_INT_ST_S)
#define PMU_ACTIVE_SWITCH_SLEEP_START_INT_ST_V  0x00000001U
#define PMU_ACTIVE_SWITCH_SLEEP_START_INT_ST_S  30
/** PMU_HP_SW_TRIGGER_INT_ST : RO; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_HP_SW_TRIGGER_INT_ST    (BIT(31))
#define PMU_HP_SW_TRIGGER_INT_ST_M  (PMU_HP_SW_TRIGGER_INT_ST_V << PMU_HP_SW_TRIGGER_INT_ST_S)
#define PMU_HP_SW_TRIGGER_INT_ST_V  0x00000001U
#define PMU_HP_SW_TRIGGER_INT_ST_S  31

/** PMU_LP_INT_ENA_REG register
 *  need_des
 */
#define PMU_LP_INT_ENA_REG (DR_REG_PMU_BASE + 0x17c)
/** PMU_LP_CPU_SLEEP_REJECT_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_SLEEP_REJECT_INT_ENA    (BIT(13))
#define PMU_LP_CPU_SLEEP_REJECT_INT_ENA_M  (PMU_LP_CPU_SLEEP_REJECT_INT_ENA_V << PMU_LP_CPU_SLEEP_REJECT_INT_ENA_S)
#define PMU_LP_CPU_SLEEP_REJECT_INT_ENA_V  0x00000001U
#define PMU_LP_CPU_SLEEP_REJECT_INT_ENA_S  13
/** PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ENA : R/W; bitpos: [14]; default: 0;
 *  reg_0p1a_0_counter after xpd reach target0
 */
#define PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ENA    (BIT(14))
#define PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ENA_M  (PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ENA_V << PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ENA_S)
#define PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ENA_V  0x00000001U
#define PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_ENA_S  14
/** PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  reg_0p1a_1_counter after xpd reach target1
 */
#define PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ENA    (BIT(15))
#define PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ENA_M  (PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ENA_V << PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ENA_S)
#define PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ENA_V  0x00000001U
#define PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_ENA_S  15
/** PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ENA : R/W; bitpos: [16]; default: 0;
 *  reg_0p1a_0 counter after xpd reach target0
 */
#define PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ENA    (BIT(16))
#define PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ENA_M  (PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ENA_V << PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ENA_S)
#define PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ENA_V  0x00000001U
#define PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_ENA_S  16
/** PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ENA : R/W; bitpos: [17]; default: 0;
 *  reg_0p1a_1_counter after xpd reach target1
 */
#define PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ENA    (BIT(17))
#define PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ENA_M  (PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ENA_V << PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ENA_S)
#define PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ENA_V  0x00000001U
#define PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_ENA_S  17
/** PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ENA : R/W; bitpos: [18]; default: 0;
 *  reg_0p2a_0 counter after xpd reach target0
 */
#define PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ENA    (BIT(18))
#define PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ENA_M  (PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ENA_V << PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ENA_S)
#define PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ENA_V  0x00000001U
#define PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_ENA_S  18
/** PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ENA : R/W; bitpos: [19]; default: 0;
 *  reg_0p2a_1_counter after xpd reach target1
 */
#define PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ENA    (BIT(19))
#define PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ENA_M  (PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ENA_V << PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ENA_S)
#define PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ENA_V  0x00000001U
#define PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_ENA_S  19
/** PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ENA : R/W; bitpos: [20]; default: 0;
 *  reg_0p2a_0 counter after xpd reach target0
 */
#define PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ENA    (BIT(20))
#define PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ENA_M  (PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ENA_V << PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ENA_S)
#define PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ENA_V  0x00000001U
#define PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_ENA_S  20
/** PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ENA : R/W; bitpos: [21]; default: 0;
 *  reg_0p2a_1_counter after xpd reach target1
 */
#define PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ENA    (BIT(21))
#define PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ENA_M  (PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ENA_V << PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ENA_S)
#define PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ENA_V  0x00000001U
#define PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_ENA_S  21
/** PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ENA : R/W; bitpos: [22]; default: 0;
 *  reg_0p3a_0 counter after xpd reach target0
 */
#define PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ENA    (BIT(22))
#define PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ENA_M  (PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ENA_V << PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ENA_S)
#define PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ENA_V  0x00000001U
#define PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_ENA_S  22
/** PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ENA : R/W; bitpos: [23]; default: 0;
 *  reg_0p3a_1_counter after xpd reach target1
 */
#define PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ENA    (BIT(23))
#define PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ENA_M  (PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ENA_V << PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ENA_S)
#define PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ENA_V  0x00000001U
#define PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_ENA_S  23
/** PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ENA : R/W; bitpos: [24]; default: 0;
 *  reg_0p3a_0_counter after xpd reach target0
 */
#define PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ENA    (BIT(24))
#define PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ENA_M  (PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ENA_V << PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ENA_S)
#define PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ENA_V  0x00000001U
#define PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_ENA_S  24
/** PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ENA : R/W; bitpos: [25]; default: 0;
 *  reg_0p3a_1_counter after xpd reach target1
 */
#define PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ENA    (BIT(25))
#define PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ENA_M  (PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ENA_V << PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ENA_S)
#define PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ENA_V  0x00000001U
#define PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_ENA_S  25
/** PMU_LP_CPU_WAKEUP_INT_ENA : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_WAKEUP_INT_ENA    (BIT(26))
#define PMU_LP_CPU_WAKEUP_INT_ENA_M  (PMU_LP_CPU_WAKEUP_INT_ENA_V << PMU_LP_CPU_WAKEUP_INT_ENA_S)
#define PMU_LP_CPU_WAKEUP_INT_ENA_V  0x00000001U
#define PMU_LP_CPU_WAKEUP_INT_ENA_S  26
/** PMU_SLEEP_SWITCH_ACTIVE_END_INT_ENA : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_SLEEP_SWITCH_ACTIVE_END_INT_ENA    (BIT(27))
#define PMU_SLEEP_SWITCH_ACTIVE_END_INT_ENA_M  (PMU_SLEEP_SWITCH_ACTIVE_END_INT_ENA_V << PMU_SLEEP_SWITCH_ACTIVE_END_INT_ENA_S)
#define PMU_SLEEP_SWITCH_ACTIVE_END_INT_ENA_V  0x00000001U
#define PMU_SLEEP_SWITCH_ACTIVE_END_INT_ENA_S  27
/** PMU_ACTIVE_SWITCH_SLEEP_END_INT_ENA : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_ACTIVE_SWITCH_SLEEP_END_INT_ENA    (BIT(28))
#define PMU_ACTIVE_SWITCH_SLEEP_END_INT_ENA_M  (PMU_ACTIVE_SWITCH_SLEEP_END_INT_ENA_V << PMU_ACTIVE_SWITCH_SLEEP_END_INT_ENA_S)
#define PMU_ACTIVE_SWITCH_SLEEP_END_INT_ENA_V  0x00000001U
#define PMU_ACTIVE_SWITCH_SLEEP_END_INT_ENA_S  28
/** PMU_SLEEP_SWITCH_ACTIVE_START_INT_ENA : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_SLEEP_SWITCH_ACTIVE_START_INT_ENA    (BIT(29))
#define PMU_SLEEP_SWITCH_ACTIVE_START_INT_ENA_M  (PMU_SLEEP_SWITCH_ACTIVE_START_INT_ENA_V << PMU_SLEEP_SWITCH_ACTIVE_START_INT_ENA_S)
#define PMU_SLEEP_SWITCH_ACTIVE_START_INT_ENA_V  0x00000001U
#define PMU_SLEEP_SWITCH_ACTIVE_START_INT_ENA_S  29
/** PMU_ACTIVE_SWITCH_SLEEP_START_INT_ENA : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_ACTIVE_SWITCH_SLEEP_START_INT_ENA    (BIT(30))
#define PMU_ACTIVE_SWITCH_SLEEP_START_INT_ENA_M  (PMU_ACTIVE_SWITCH_SLEEP_START_INT_ENA_V << PMU_ACTIVE_SWITCH_SLEEP_START_INT_ENA_S)
#define PMU_ACTIVE_SWITCH_SLEEP_START_INT_ENA_V  0x00000001U
#define PMU_ACTIVE_SWITCH_SLEEP_START_INT_ENA_S  30
/** PMU_HP_SW_TRIGGER_INT_ENA : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_HP_SW_TRIGGER_INT_ENA    (BIT(31))
#define PMU_HP_SW_TRIGGER_INT_ENA_M  (PMU_HP_SW_TRIGGER_INT_ENA_V << PMU_HP_SW_TRIGGER_INT_ENA_S)
#define PMU_HP_SW_TRIGGER_INT_ENA_V  0x00000001U
#define PMU_HP_SW_TRIGGER_INT_ENA_S  31

/** PMU_LP_INT_CLR_REG register
 *  need_des
 */
#define PMU_LP_INT_CLR_REG (DR_REG_PMU_BASE + 0x180)
/** PMU_LP_CPU_SLEEP_REJECT_LP_INT_CLR : WT; bitpos: [13]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_SLEEP_REJECT_LP_INT_CLR    (BIT(13))
#define PMU_LP_CPU_SLEEP_REJECT_LP_INT_CLR_M  (PMU_LP_CPU_SLEEP_REJECT_LP_INT_CLR_V << PMU_LP_CPU_SLEEP_REJECT_LP_INT_CLR_S)
#define PMU_LP_CPU_SLEEP_REJECT_LP_INT_CLR_V  0x00000001U
#define PMU_LP_CPU_SLEEP_REJECT_LP_INT_CLR_S  13
/** PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_CLR : WT; bitpos: [14]; default: 0;
 *  reg_0p1a_0_counter after xpd reach target0
 */
#define PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_CLR    (BIT(14))
#define PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_CLR_M  (PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_CLR_V << PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_CLR_S)
#define PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_CLR_V  0x00000001U
#define PMU_0P1A_CNT_TARGET0_REACH_0_LP_INT_CLR_S  14
/** PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_CLR : WT; bitpos: [15]; default: 0;
 *  reg_0p1a_1_counter after xpd reach target1
 */
#define PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_CLR    (BIT(15))
#define PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_CLR_M  (PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_CLR_V << PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_CLR_S)
#define PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_CLR_V  0x00000001U
#define PMU_0P1A_CNT_TARGET1_REACH_0_LP_INT_CLR_S  15
/** PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_CLR : WT; bitpos: [16]; default: 0;
 *  reg_0p1a_0 counter after xpd reach target0
 */
#define PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_CLR    (BIT(16))
#define PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_CLR_M  (PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_CLR_V << PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_CLR_S)
#define PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_CLR_V  0x00000001U
#define PMU_0P1A_CNT_TARGET0_REACH_1_LP_INT_CLR_S  16
/** PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_CLR : WT; bitpos: [17]; default: 0;
 *  reg_0p1a_1_counter after xpd reach target1
 */
#define PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_CLR    (BIT(17))
#define PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_CLR_M  (PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_CLR_V << PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_CLR_S)
#define PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_CLR_V  0x00000001U
#define PMU_0P1A_CNT_TARGET1_REACH_1_LP_INT_CLR_S  17
/** PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_CLR : WT; bitpos: [18]; default: 0;
 *  reg_0p2a_0 counter after xpd reach target0
 */
#define PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_CLR    (BIT(18))
#define PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_CLR_M  (PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_CLR_V << PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_CLR_S)
#define PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_CLR_V  0x00000001U
#define PMU_0P2A_CNT_TARGET0_REACH_0_LP_INT_CLR_S  18
/** PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_CLR : WT; bitpos: [19]; default: 0;
 *  reg_0p2a_1_counter after xpd reach target1
 */
#define PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_CLR    (BIT(19))
#define PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_CLR_M  (PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_CLR_V << PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_CLR_S)
#define PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_CLR_V  0x00000001U
#define PMU_0P2A_CNT_TARGET1_REACH_0_LP_INT_CLR_S  19
/** PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_CLR : WT; bitpos: [20]; default: 0;
 *  reg_0p2a_0 counter after xpd reach target0
 */
#define PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_CLR    (BIT(20))
#define PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_CLR_M  (PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_CLR_V << PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_CLR_S)
#define PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_CLR_V  0x00000001U
#define PMU_0P2A_CNT_TARGET0_REACH_1_LP_INT_CLR_S  20
/** PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_CLR : WT; bitpos: [21]; default: 0;
 *  reg_0p2a_1_counter after xpd reach target1
 */
#define PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_CLR    (BIT(21))
#define PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_CLR_M  (PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_CLR_V << PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_CLR_S)
#define PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_CLR_V  0x00000001U
#define PMU_0P2A_CNT_TARGET1_REACH_1_LP_INT_CLR_S  21
/** PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_CLR : WT; bitpos: [22]; default: 0;
 *  reg_0p3a_0 counter after xpd reach target0
 */
#define PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_CLR    (BIT(22))
#define PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_CLR_M  (PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_CLR_V << PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_CLR_S)
#define PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_CLR_V  0x00000001U
#define PMU_0P3A_CNT_TARGET0_REACH_0_LP_INT_CLR_S  22
/** PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_CLR : WT; bitpos: [23]; default: 0;
 *  reg_0p3a_1_counter after xpd reach target1
 */
#define PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_CLR    (BIT(23))
#define PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_CLR_M  (PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_CLR_V << PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_CLR_S)
#define PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_CLR_V  0x00000001U
#define PMU_0P3A_CNT_TARGET1_REACH_0_LP_INT_CLR_S  23
/** PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_CLR : WT; bitpos: [24]; default: 0;
 *  reg_0p3a_0_counter after xpd reach target0
 */
#define PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_CLR    (BIT(24))
#define PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_CLR_M  (PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_CLR_V << PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_CLR_S)
#define PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_CLR_V  0x00000001U
#define PMU_0P3A_CNT_TARGET0_REACH_1_LP_INT_CLR_S  24
/** PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_CLR : WT; bitpos: [25]; default: 0;
 *  reg_0p3a_1_counter after xpd reach target1
 */
#define PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_CLR    (BIT(25))
#define PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_CLR_M  (PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_CLR_V << PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_CLR_S)
#define PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_CLR_V  0x00000001U
#define PMU_0P3A_CNT_TARGET1_REACH_1_LP_INT_CLR_S  25
/** PMU_LP_CPU_WAKEUP_INT_CLR : WT; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_LP_CPU_WAKEUP_INT_CLR    (BIT(26))
#define PMU_LP_CPU_WAKEUP_INT_CLR_M  (PMU_LP_CPU_WAKEUP_INT_CLR_V << PMU_LP_CPU_WAKEUP_INT_CLR_S)
#define PMU_LP_CPU_WAKEUP_INT_CLR_V  0x00000001U
#define PMU_LP_CPU_WAKEUP_INT_CLR_S  26
/** PMU_SLEEP_SWITCH_ACTIVE_END_INT_CLR : WT; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_SLEEP_SWITCH_ACTIVE_END_INT_CLR    (BIT(27))
#define PMU_SLEEP_SWITCH_ACTIVE_END_INT_CLR_M  (PMU_SLEEP_SWITCH_ACTIVE_END_INT_CLR_V << PMU_SLEEP_SWITCH_ACTIVE_END_INT_CLR_S)
#define PMU_SLEEP_SWITCH_ACTIVE_END_INT_CLR_V  0x00000001U
#define PMU_SLEEP_SWITCH_ACTIVE_END_INT_CLR_S  27
/** PMU_ACTIVE_SWITCH_SLEEP_END_INT_CLR : WT; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_ACTIVE_SWITCH_SLEEP_END_INT_CLR    (BIT(28))
#define PMU_ACTIVE_SWITCH_SLEEP_END_INT_CLR_M  (PMU_ACTIVE_SWITCH_SLEEP_END_INT_CLR_V << PMU_ACTIVE_SWITCH_SLEEP_END_INT_CLR_S)
#define PMU_ACTIVE_SWITCH_SLEEP_END_INT_CLR_V  0x00000001U
#define PMU_ACTIVE_SWITCH_SLEEP_END_INT_CLR_S  28
/** PMU_SLEEP_SWITCH_ACTIVE_START_INT_CLR : WT; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_SLEEP_SWITCH_ACTIVE_START_INT_CLR    (BIT(29))
#define PMU_SLEEP_SWITCH_ACTIVE_START_INT_CLR_M  (PMU_SLEEP_SWITCH_ACTIVE_START_INT_CLR_V << PMU_SLEEP_SWITCH_ACTIVE_START_INT_CLR_S)
#define PMU_SLEEP_SWITCH_ACTIVE_START_INT_CLR_V  0x00000001U
#define PMU_SLEEP_SWITCH_ACTIVE_START_INT_CLR_S  29
/** PMU_ACTIVE_SWITCH_SLEEP_START_INT_CLR : WT; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_ACTIVE_SWITCH_SLEEP_START_INT_CLR    (BIT(30))
#define PMU_ACTIVE_SWITCH_SLEEP_START_INT_CLR_M  (PMU_ACTIVE_SWITCH_SLEEP_START_INT_CLR_V << PMU_ACTIVE_SWITCH_SLEEP_START_INT_CLR_S)
#define PMU_ACTIVE_SWITCH_SLEEP_START_INT_CLR_V  0x00000001U
#define PMU_ACTIVE_SWITCH_SLEEP_START_INT_CLR_S  30
/** PMU_HP_SW_TRIGGER_INT_CLR : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_HP_SW_TRIGGER_INT_CLR    (BIT(31))
#define PMU_HP_SW_TRIGGER_INT_CLR_M  (PMU_HP_SW_TRIGGER_INT_CLR_V << PMU_HP_SW_TRIGGER_INT_CLR_S)
#define PMU_HP_SW_TRIGGER_INT_CLR_V  0x00000001U
#define PMU_HP_SW_TRIGGER_INT_CLR_S  31

